In [ ]:
#Logistic regression
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df=pd.read_csv(r"C:\Users\Admin\Downloads\suv.zip")
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [33]:
x=df.iloc[:,2:4]
x

     Age  EstimatedSalary
0     19            19000
1     35            20000
2     26            43000
3     27            57000
4     19            76000
..   ...              ...
395   46            41000
396   51            23000
397   50            20000
398   36            33000
399   49            36000

[400 rows x 2 columns]

In [34]:
y=df.iloc[:,4:]
y

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

In [ ]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()
xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size=0.2, random_state=42)
model.fit(xtrain,ytrain)
ans=model.predict(xtest)
model.score(xtest,ytest)

In [36]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(ytest,ans)
print(cm)

[[50  2]
 [ 7 21]]

In [37]:
tn,fp,fn,tp=cm.ravel()

In [38]:
print(f'True Negative : {tn}')
print(f'False Positive : {fp}')
print(f'False Negative : {fn}')
print(f'True Positive : {tp}')

True Negative : 50
False Positive : 2
False Negative : 7
True Positive : 21

In [39]:
ans1 =model.score(xtest,ytest)
ans1

0.8875

In [40]:
ans2 =model.score(xtrain,ytrain)
ans2

0.8375